In [1]:
import pandas as pd
import numpy as np 
from scipy import stats

In [4]:
df = pd.read_csv("chiSquare.csv")

df.head()

      City Brand
0   Mumbai     A
1  Chennai     C
2   Mumbai     A
3   Mumbai     C
4  Chennai     C

In [5]:
contingency_table = pd.crosstab(df.City, df.Brand, margins=True)

In [6]:
contingency_table

Brand      A    B    C  All
City
Chennai  165   47  191  403
Mumbai   279   73  225  577
All      444  120  416  980

In [7]:
contingency_table['A']

City
Chennai    165
Mumbai     279
All        444
Name: A, dtype: int64

In [8]:
contingency_table['A']['Chennai']

np.int64(165)

In [9]:
contingency_table['All']['All']

np.int64(980)

In [10]:
contingency_table.transpose()

City   Chennai  Mumbai  All
Brand
A          165     279  444
B           47      73  120
C          191     225  416
All        403     577  980

In [13]:
cities = list(df['City'].unique())
brands = list(df['Brand'].unique())


result = {}


for i in cities:
    exp = {}
    for j in brands:
        exp[j] = contingency_table.transpose()[i]['All'] * contingency_table[j]['All'] / (contingency_table['All']['All'])

    result[i] = exp

In [14]:
result

{'Mumbai': {'A': np.float64(261.41632653061225),
  'C': np.float64(244.93061224489796),
  'B': np.float64(70.65306122448979)},
 'Chennai': {'A': np.float64(182.58367346938775),
  'C': np.float64(171.06938775510204),
  'B': np.float64(49.3469387755102)}}

In [18]:
chiSquareCalc = 0

for i in cities:
    for  j in brands:
        val = (contingency_table.transpose()[i][j] - result[i][j])**2/ result[i][j]
        chiSquareCalc = chiSquareCalc + val

In [19]:
print(chiSquareCalc)

7.009543616823935

In [20]:
dof = (len(cities)-1) * (len(brands) - 1)

In [21]:
print(dof)

2

In [22]:
stats.chi2.ppf(1-0.05, df=dof)

np.float64(5.991464547107979)